// ConsoleApplication11.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <time.h>
using namespace std;


int main()
{
    //const int m = 7, n = 5;
    //int arr[5][7] = {};
    //int rowsum[m] = {};
    //int columsum[n] = {};
    //srand(time(NULL));
    //for (int  i = 0; i < m; i++)
    //{
       // cout << "|";
        //for (int j = 0; j < n; j++)
        //{
          //  arr[i][j] = rand() % +10;
            //cout<<
        //}
    //}
    int arr[5][5];
    int min, max;
    int sum = 0, cout = 0;
    max = min = arr[0][0];
    for (int i = 0; i < 5; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            sum += arr[i][j];
            cout++;
            if (arr[i][j] > max) {
                max = arr[i][j];
            }
            if (arr[i][j] < min)
            {
                min = arr[i][j];
            }
        }
    }
    cout << sum;
    cout << sum / cout;
    cout << min;
    cout << max;
}
    
    

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
